---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ArcLengthDimensionNoReferencesOnArc
source: html/9e96bca9-c919-daba-d70e-1d94a119cbac.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ArcLengthDimensionNoReferencesOnArc Property

None of the segment references of this Arc Length Dimension intersects the bounded arc of the arc reference.

## Syntax (C#)
```csharp
public static FailureDefinitionId ArcLengthDimensionNoReferencesOnArc { get; }
```